goplus/llgo/targets/device/stm32/stm32l0x0.s
// Automatically generated file. DO NOT EDIT.
// Generated by gen-device-svd.go from stm32l0x0.svd, see https://github.com/tinygo-org/stm32-svd

/*
// STM32L0x0
*/



.syntax unified

// This is the default handler for interrupts, if triggered but not defined.
.section .text.Default_Handler
.global  Default_Handler
.type    Default_Handler, %function
Default_Handler:
    wfe
    b    Default_Handler
.size Default_Handler, .-Default_Handler

// Avoid the need for repeated .weak and .set instructions.
.macro IRQ handler
    .weak  \handler
    .set   \handler, Default_Handler
.endm

// Must set the "a" flag on the section:
// https://svnweb.freebsd.org/base/stable/11/sys/arm/arm/locore-v4.S?r1=321049&r2=321048&pathrev=321049
// https://sourceware.org/binutils/docs/as/Section.html#ELF-Version
.section .isr_vector, "a", %progbits
.global  __isr_vector
__isr_vector:
    // Interrupt vector as defined by Cortex-M, starting with the stack top.
    // On reset, SP is initialized with *0x0 and PC is loaded with *0x4, loading
    // _stack_top and Reset_Handler.
    .long _stack_top
    .long Reset_Handler
    .long NMI_Handler
    .long HardFault_Handler
    .long MemoryManagement_Handler
    .long BusFault_Handler
    .long UsageFault_Handler
    .long 0
    .long 0
    .long 0
    .long 0
    .long SVC_Handler
    .long DebugMon_Handler
    .long 0
    .long PendSV_Handler
    .long SysTick_Handler

    // Extra interrupts for peripherals defined by the hardware vendor.
    .long WWDG_IRQHandler
    .long 0
    .long RTC_IRQHandler
    .long FLASH_IRQHandler
    .long RCC_IRQHandler
    .long EXTI0_1_IRQHandler
    .long EXTI2_3_IRQHandler
    .long EXTI4_15_IRQHandler
    .long 0
    .long DMA1_Channel1_IRQHandler
    .long DMA1_Channel2_3_IRQHandler
    .long DMA1_Channel4_7_IRQHandler
    .long ADC_IRQHandler
    .long LPTIM1_IRQHandler
    .long 0
    .long TIM2_IRQHandler
    .long 0
    .long 0
    .long 0
    .long 0
    .long TIM21_IRQHandler
    .long 0
    .long TIM22_IRQHandler
    .long I2C1_IRQHandler
    .long 0
    .long SPI1_IRQHandler
    .long 0
    .long 0
    .long USART2_IRQHandler
    .long LPUART1_IRQHandler

    // Define default implementations for interrupts, redirecting to
    // Default_Handler when not implemented.
    IRQ NMI_Handler
    IRQ HardFault_Handler
    IRQ MemoryManagement_Handler
    IRQ BusFault_Handler
    IRQ UsageFault_Handler
    IRQ SVC_Handler
    IRQ DebugMon_Handler
    IRQ PendSV_Handler
    IRQ SysTick_Handler
    IRQ WWDG_IRQHandler
    IRQ RTC_IRQHandler
    IRQ FLASH_IRQHandler
    IRQ RCC_IRQHandler
    IRQ EXTI0_1_IRQHandler
    IRQ EXTI2_3_IRQHandler
    IRQ EXTI4_15_IRQHandler
    IRQ DMA1_Channel1_IRQHandler
    IRQ DMA1_Channel2_3_IRQHandler
    IRQ DMA1_Channel4_7_IRQHandler
    IRQ ADC_IRQHandler
    IRQ LPTIM1_IRQHandler
    IRQ TIM2_IRQHandler
    IRQ TIM21_IRQHandler
    IRQ TIM22_IRQHandler
    IRQ I2C1_IRQHandler
    IRQ SPI1_IRQHandler
    IRQ USART2_IRQHandler
    IRQ LPUART1_IRQHandler

.size __isr_vector, .-__isr_vector
